Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAL169.atdf
      <value-group caption="Group 2 Write Permissions bits" name="SBT5WR4__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT5WR4__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT6WR0__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT6WR0__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT6WR0__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT6WR0__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT6WR1__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT6WR1__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT6WR1__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT6WR1__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT7WR0__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT7WR0__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT7WR0__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT7WR0__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT7WR1__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT7WR1__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT7WR1__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT7WR1__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT7WR2__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT7WR2__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT7WR2__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT7WR2__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
