Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.4.118/atdf/PIC32MZ1025DAL169.atdf
         <register caption="USB Control Status Register 2" name="USBCSR2" offset="0x8" rw="RW" size="4">
            <bitfield caption="Endpoint 1 Receive Interrupt Enable bit" mask="0x00000002" name="EP1RXIE" values="USBCSR2__EP1RXIE" />
            <bitfield caption="Endpoint 2 Receive Interrupt Enable bit" mask="0x00000004" name="EP2RXIE" values="USBCSR2__EP2RXIE" />
            <bitfield caption="Endpoint 3 Receive Interrupt Enable bit" mask="0x00000008" name="EP3RXIE" values="USBCSR2__EP3RXIE" />
            <bitfield caption="Endpoint 4 Receive Interrupt Enable bit" mask="0x00000010" name="EP4RXIE" values="USBCSR2__EP4RXIE" />
            <bitfield caption="Endpoint 5 Receive Interrupt Enable bit" mask="0x00000020" name="EP5RXIE" values="USBCSR2__EP5RXIE" />
            <bitfield caption="Endpoint 6 Receive Interrupt Enable bit" mask="0x00000040" name="EP6RXIE" values="USBCSR2__EP6RXIE" />
            <bitfield caption="Endpoint 7 Receive Interrupt Enable bit" mask="0x00000080" name="EP7RXIE" values="USBCSR2__EP7RXIE" />
            <bitfield caption="Suspend Interrupt bit" mask="0x00010000" name="SUSPIF" values="USBCSR2__SUSPIF" />
            <bitfield caption="Resume Interrupt bit" mask="0x00020000" name="RESUMEIF" values="USBCSR2__RESUMEIF" />
            <bitfield caption="Reset/Babble Interrupt bit" mask="0x00040000" name="RESETIF" values="USBCSR2__RESETIF" />
            <bitfield caption="Start of Frame Interrupt bit" mask="0x00080000" name="SOFIF" values="USBCSR2__SOFIF" />
            <bitfield caption="Device Connection Interrupt bit" mask="0x00100000" name="CONNIF" values="USBCSR2__CONNIF" />
            <bitfield caption="Device Disconnect Interrupt bit" mask="0x00200000" name="DISCONIF" values="USBCSR2__DISCONIF" />
            <bitfield caption="Session Request Interrupt bit" mask="0x00400000" name="SESSRQIF" values="USBCSR2__SESSRQIF" />
            <bitfield caption="Vbus Error Interrupt bit" mask="0x00800000" name="VBUSERRIF" values="USBCSR2__VBUSERRIF" />
            <bitfield caption="Suspend Interrupt Enable bit" mask="0x01000000" name="SUSPIE" values="USBCSR2__SUSPIE" />
            <bitfield caption="Resume Interrupt Enable bit" mask="0x02000000" name="RESUMEIE" values="USBCSR2__RESUMEIE" />
            <bitfield caption="Reset/Babble Interrupt Enable bit" mask="0x04000000" name="RESETIE" values="USBCSR2__RESETIE" />
            <bitfield caption="Start of Frame Interrupt Enable bit" mask="0x08000000" name="SOFIE" values="USBCSR2__SOFIE" />
            <bitfield caption="Device Connection Interrupt Enable bit" mask="0x10000000" name="CONNIE" values="USBCSR2__CONNIE" />
            <bitfield caption="Device Disconnect Interrupt Enable bit" mask="0x20000000" name="DISCONIE" values="USBCSR2__DISCONIE" />
            <bitfield caption="Session Request Interrupt Enable bit" mask="0x40000000" name="SESSRQIE" values="USBCSR2__SESSRQIE" />
            <bitfield caption="Vbus Error Interrupt Enable bit" mask="0x80000000" name="VBUSERRIE" values="USBCSR2__VBUSERRIE" />
         </register>
         <register caption="USB Control Status Register 3" name="USBCSR3" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RFRMNUM" />
            <bitfield caption="Endpoint Registers Select bits" mask="0x000F0000" name="ENDPOINT" values="USBCSR3__ENDPOINT" />
            <bitfield caption="Test_SE0_NAK Test Mode Select bit" mask="0x01000000" name="NAK" values="USBCSR3__NAK" />
            <bitfield caption="Test_J Test Mode Select bit" mask="0x02000000" name="TESTJ" values="USBCSR3__TESTJ" />
            <bitfield caption="Test_K Test Mode Select bit" mask="0x04000000" name="TESTK" values="USBCSR3__TESTK" />
            <bitfield caption="Test_Packet Test Mode Select bit" mask="0x08000000" name="PACKET" values="USBCSR3__PACKET" />
            <bitfield caption="Test mode Force Hi-Speed Mode Select bit" mask="0x10000000" name="FORCEHS" values="USBCSR3__FORCEHS" />
            <bitfield caption="Test mode Force Full-Speed Mode Select bit" mask="0x20000000" name="FORCEFS" values="USBCSR3__FORCEFS" />
            <bitfield caption="Test Mode Endpoint 0 FIFO Transfer Force bit" mask="0x40000000" name="FIFOACC" values="USBCSR3__FIFOACC" />
            <bitfield caption="Test Mode Force Host Select bit" mask="0x80000000" name="FORCEHST" values="USBCSR3__FORCEHST" />
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 0 (Endpoint 0)" name="USBIE0CSR0" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP" />
            <bitfield mask="0x00010000" name="RXRDY" />
            <bitfield mask="0x00020000" name="TXRDY" />
            <bitfield mask="0x00040000" name="STALLED" />
            <bitfield mask="0x00080000" name="SETUP" />
            <bitfield mask="0x00100000" name="ERROR" />
            <bitfield mask="0x00200000" name="REQPKT" />
            <bitfield mask="0x00400000" name="STATUS" />
            <bitfield mask="0x00800000" name="NAKTO" />
            <bitfield mask="0x01000000" name="FLUSH" />
            <bitfield mask="0x02000000" name="DT" />
            <bitfield mask="0x04000000" name="DTWE" />
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 0 (Endpoint 1-7)" name="USBIENCSR0" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="TXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield mask="0x00010000" name="TXPKTRDY" />
            <bitfield caption="FIFO Not Empty status bit" mask="0x00020000" name="FIFONE" values="USBIENCSR0__FIFONE" />
            <bitfield caption="Underrun status bit" mask="0x00040000" name="ERROR" values="USBIENCSR0__ERROR" />
            <bitfield caption="FIFO Flush control bit" mask="0x00080000" name="FLUSH" values="USBIENCSR0__FLUSH" />
            <bitfield caption="STALL handshake transmission control bit" mask="0x00100000" name="SETUPPKT" values="USBIENCSR0__SETUPPKT" />
            <bitfield caption="STALL handshake transmission status bit" mask="0x00200000" name="RXSTALL" values="USBIENCSR0__RXSTALL" />
            <bitfield caption="Clear Data Toggle Control bit" mask="0x00400000" name="CLRDT" values="USBIENCSR0__CLRDT" />
            <bitfield caption="Incomplete TX Status bit" mask="0x00800000" name="NAKTMOUT" values="USBIENCSR0__NAKTMOUT" />
            <bitfield mask="0x01000000" name="DATATGGL" />
            <bitfield mask="0x02000000" name="DTWREN" />
            <bitfield caption="Endpoint DMA Request Mode Control bit" mask="0x04000000" name="DMAREQMD" values="USBIENCSR0__DMAREQMD" />
            <bitfield caption="Force Endpoint Data Toggle Control bit" mask="0x08000000" name="FRCDATTG" values="USBIENCSR0__FRCDATTG" />
            <bitfield caption="Endpoint DMA Request Enable bit" mask="0x10000000" name="DMAREQEN" values="USBIENCSR0__DMAREQEN" />
            <bitfield caption="Endpoint Direction Control bit" mask="0x20000000" name="MODE" values="USBIENCSR0__MODE" />
            <bitfield caption="Auto Set Control bit" mask="0x80000000" name="AUTOSET" values="USBIENCSR0__AUTOSET" />
         </register>
